Repository: anemoris/Colofa
Catalog: Colofa/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# pushRejectedDescription
source: “%1$@” was not pushed, because “%2$@” contains work this branch does not have. Fetch, then Merge or Rebase, and push again.
ja: 「%2$@」にはこのブランチにない作業が含まれているため、「%1$@」はプッシュされませんでした。フェッチしてからマージまたはリベースし、もう一度プッシュしてください。
ko: “%2$@”에 이 브랜치에 없는 작업이 있어 “%1$@”은(는) 푸시되지 않았습니다. 페치한 뒤 병합 또는 리베이스하고 다시 푸시하세요.
zh_hans: “%2$@”包含此分支没有的工作，因此“%1$@”未被推送。请先获取，再合并或变基，然后重新推送。
zh_hant: 「%2$@」包含此分支沒有的工作，因此「%1$@」未被推送。請先擷取，再合併或重定基底，然後重新推送。

# pushLeaseRefusedTitle
source: Force Push Refused
ja: 強制プッシュが拒否されました
ko: 강제 푸시 거부됨
zh_hans: 强制推送被拒绝
zh_hant: 強制推送被拒絕

# pushLeaseRefusedDescription
source: “%@” has changed since this Push was confirmed, so the lease refused to overwrite it. Fetch and review the new work before force pushing again.
ja: このプッシュを確認してから「%@」が変化したため、リースが上書きを拒否しました。もう一度強制プッシュする前に、フェッチして新しい作業を確認してください。
ko: 이 푸시를 확인한 뒤 “%@”이(가) 변경되어 리스가 덮어쓰기를 거부했습니다. 다시 강제 푸시하기 전에 페치하여 새 작업을 확인하세요.
zh_hans: 自确认本次推送后“%@”已发生变化，租约拒绝覆盖它。请先获取并查看新的工作，再重新强制推送。
zh_hant: 自確認本次推送後「%@」已發生變化，租約拒絕覆蓋它。請先擷取並查看新的工作，再重新強制推送。

# pushRemoteRefusedTitle
source: Remote Refused the Push
ja: リモートがプッシュを拒否しました
ko: 원격이 푸시를 거부함
zh_hans: 远程拒绝了推送
zh_hant: 遠端拒絕了推送

# pushRemoteRefusedDescription
source: The remote declined to update “%@”. A hook or a branch protection rule usually explains it, and the remote's own answer is below.
ja: リモートは「%@」の更新を拒否しました。通常はフックかブランチ保護の設定が理由で、リモート自身の応答は下に表示されます。
ko: 원격이 “%@” 갱신을 거부했습니다. 대개 훅이나 브랜치 보호 규칙이 이유이며, 원격의 응답은 아래에 있습니다.
zh_hans: 远程拒绝更新“%@”。通常是钩子或分支保护规则所致，远程自己的回应见下方。
zh_hant: 遠端拒絕更新「%@」。通常是掛鉤或分支保護規則所致，遠端自己的回應見下方。

# pushPublishingTo
source: Publishing to “%@”…
ja: 「%@」へ公開中…
ko: “%@”에 게시하는 중…
zh_hans: 正在发布到“%@”…
zh_hant: 正在發布至「%@」…

# pushSendingTo
source: Pushing to “%@”…
ja: 「%@」へプッシュ中…
ko: “%@”에 푸시하는 중…
zh_hans: 正在推送到“%@”…
zh_hant: 正在推送至「%@」…

# pushForcingTo
source: Force pushing to “%@”…
ja: 「%@」へ強制プッシュ中…
ko: “%@”에 강제 푸시하는 중…
zh_hans: 正在强制推送到“%@”…
zh_hant: 正在強制推送至「%@」…

# pushDestination
source: Destination
ja: 宛先
ko: 대상
zh_hans: 目的地
zh_hant: 目的地

# pushDestinationLocalTitle
source: This Remote Is Not a Remote
ja: このリモートはリモートではありません
ko: 이 원격은 원격이 아닙니다
zh_hans: 此远程并非远程
zh_hant: 此遠端並非遠端

# pushDestinationLocalDescription
source: “%@” is Git's own name for this repository, so pushing to it would rewrite a local branch instead of sending this one anywhere. Colofa pushes to remotes only. Give this branch a real push remote in Git to continue.
ja: 「%@」は Git がこのリポジトリ自身を指す名前です。そのためプッシュしても、どこかに送られるのではなくローカルブランチが書き換えられます。Colofa はリモートにのみプッシュします。続けるには、このブランチに実際のプッシュ先リモートを Git で設定してください。
ko: “%@”은(는) Git이 이 저장소 자신을 가리키는 이름이므로, 푸시하면 어딘가로 보내는 대신 로컬 브랜치를 다시 씁니다. Colofa는 원격에만 푸시합니다. 계속하려면 Git에서 이 브랜치에 실제 푸시 원격을 설정하세요.
zh_hans: “%@”是 Git 用来指代本仓库自身的名称，因此推送到它会改写一个本地分支，而不是把当前分支发送到任何地方。Colofa 只推送到远程。请先在 Git 中为该分支设置真正的推送远程。
zh_hant: 「%@」是 Git 用來指稱本儲存庫自身的名稱，因此推送到它會改寫一個本機分支，而不是把目前分支傳送到任何地方。Colofa 只推送到遠端。請先在 Git 中為該分支設定真正的推送遠端。

# pushDestinationSeveralTitle
source: This Remote Has Several Push Addresses
ja: このリモートには複数のプッシュ先があります
ko: 이 원격에는 푸시 주소가 여러 개 있습니다
zh_hans: 此远程配置了多个推送地址
zh_hant: 此遠端設定了多個推送位址

# pushDestinationSeveralDescription
source: One push to “%1$@” writes to every address below in turn, so no single confirmation can say where it goes. A force push accepted at one address and refused at another cannot be rolled back as a whole. Leave one push address configured to continue. %2$@
ja: 「%1$@」への 1 回のプッシュは以下のすべてのアドレスに順に書き込むため、どこへ送られるのかを 1 つの確認で示すことはできません。あるアドレスでは受け入れられ別のアドレスでは拒否された強制プッシュは、全体としては取り消せません。続けるには、プッシュ先を 1 つだけ設定してください。 %2$@
ko: “%1$@”에 대한 한 번의 푸시는 아래의 모든 주소에 차례로 쓰므로, 한 번의 확인으로 어디로 가는지 말할 수 없습니다. 한 주소에서는 수락되고 다른 주소에서는 거부된 강제 푸시는 전체를 되돌릴 수 없습니다. 계속하려면 푸시 주소를 하나만 설정하세요. %2$@
zh_hans: 对“%1$@”的一次推送会依次写入下面的每个地址，因此没有任何一次确认能说明它究竟写到了哪里。若强制推送在一个地址被接受、在另一个地址被拒绝，将无法整体回滚。请只保留一个推送地址后再继续。 %2$@
zh_hant: 對「%1$@」的一次推送會依序寫入下面的每個位址，因此沒有任何一次確認能說明它究竟寫到了哪裡。若強制推送在一個位址被接受、在另一個位址被拒絕，將無法整體回復。請只保留一個推送位址後再繼續。 %2$@

# pushDestinationChangedTitle
source: The Push Destination Changed
ja: プッシュ先が変わりました
ko: 푸시 대상이 변경되었습니다
zh_hans: 推送目的地已改变
zh_hant: 推送目的地已改變

# pushDestinationChangedDescription
source: “%@” no longer points at the address this Push was confirmed for, so nothing was sent. Open Push again to confirm the new destination.
ja: 「%@」は、このプッシュを確認したときのアドレスをもう指していません。そのため何も送信されませんでした。新しい宛先を確認するには、もう一度プッシュを開いてください。
ko: “%@”은(는) 이 푸시를 확인한 주소를 더 이상 가리키지 않으므로 아무것도 전송되지 않았습니다. 새 대상을 확인하려면 푸시를 다시 여세요.
zh_hans: “%@”已不再指向确认本次推送时的地址，因此什么也没有发送。请重新打开推送以确认新的目的地。
zh_hant: 「%@」已不再指向確認本次推送時的位址，因此什麼也沒有傳送。請重新開啟推送以確認新的目的地。

# pushUnavailableNoRepository
source: Open a Repository first.
ja: 先にリポジトリを開いてください。
ko: 먼저 저장소를 여세요.
zh_hans: 请先打开仓库。
zh_hant: 請先開啟儲存庫。

# pushUnavailableDetachedHead
source: HEAD is detached. Check out a Branch before pushing.
ja: HEAD が分離しています。プッシュする前にブランチをチェックアウトしてください。
ko: HEAD가 분리되어 있습니다. 푸시하기 전에 브랜치를 체크아웃하세요.
zh_hans: HEAD 处于分离状态。请先签出分支再推送。
zh_hant: HEAD 處於分離狀態。請先簽出分支再推送。

# pushUnavailableUnbornBranch
source: This Branch has no Commit to push yet.
ja: このブランチにはまだプッシュできるコミットがありません。
ko: 이 브랜치에는 아직 푸시할 커밋이 없습니다.
zh_hans: 此分支还没有可推送的提交。
zh_hant: 此分支還沒有可推送的提交。

# pushUnavailableNoRemote
source: This Repository has no remote to push to.
ja: このリポジトリにはプッシュ先のリモートがありません。
ko: 이 저장소에는 푸시할 원격이 없습니다.
zh_hans: 此仓库没有可推送的远程。
zh_hant: 此儲存庫沒有可推送的遠端。

# pushUnavailablePushInProgress
source: A Push is already running.
ja: プッシュがすでに実行中です。
ko: 푸시가 이미 실행 중입니다.
zh_hans: 已有一次推送正在运行。
zh_hant: 已有一次推送正在執行。

# pushUnavailableMutationInProgress
source: Another Git command is still running.
ja: 別の Git コマンドがまだ実行中です。
ko: 다른 Git 명령이 아직 실행 중입니다.
zh_hans: 另一条 Git 命令仍在运行。
zh_hant: 另一條 Git 命令仍在執行。

# settingsGeneral
source: General
ja: 一般
ko: 일반
zh_hans: 通用
zh_hant: 一般

source: Display Language
ja: 表示言語
ko: 표시 언어
zh_hans: 显示语言
zh_hant: 顯示語言

source: Follow System
ja: システムに従う
ko: 시스템 설정 따름
zh_hans: 跟随系统
zh_hant: 跟隨系統

# languageAppliesOnNextLaunch
source: The display language applies the next time Colofa launches.
ja: 表示言語は次に Colofa を起動したときに適用されます。
ko: 표시 언어는 Colofa를 다음에 실행할 때 적용됩니다.
zh_hans: 显示语言将在下次启动 Colofa 时生效。
zh_hant: 顯示語言將在下次啟動 Colofa 時生效。

source: Relaunch Now
ja: 今すぐ再起動
ko: 지금 다시 실행
zh_hans: 立即重新启动
zh_hant: 立即重新啟動

# relaunchNowHelp
source: Relaunch Colofa now so the display language applies.
ja: Colofa を今すぐ再起動して表示言語を適用します。
ko: 지금 Colofa를 다시 실행하여 표시 언어를 적용합니다.
zh_hans: 立即重新启动 Colofa 以应用显示语言。
zh_hant: 立即重新啟動 Colofa 以套用顯示語言。

# relaunchUnavailableWhileBusy
source: Colofa can relaunch once the running Git operation finishes.
ja: 実行中の Git 操作が完了すると Colofa を再起動できます。
ko: 실행 중인 Git 작업이 끝나면 Colofa를 다시 실행할 수 있습니다.
zh_hans: 正在运行的 Git 操作完成后即可重新启动 Colofa。
zh_hant: 執行中的 Git 操作完成後即可重新啟動 Colofa。

# relaunchFailed
source: Colofa could not relaunch. Quit and open it again to apply the display language.
ja: Colofa を再起動できませんでした。終了してもう一度開くと表示言語が適用されます。
ko: Colofa를 다시 실행하지 못했습니다. 종료한 뒤 다시 열면 표시 언어가 적용됩니다.
zh_hans: 无法重新启动 Colofa。请退出后重新打开以应用显示语言。
zh_hant: 無法重新啟動 Colofa。請結束後重新開啟以套用顯示語言。

# deleteBranchRefusedDescription
source: Git refused to delete the branch.
ja: Git はブランチの削除を拒否しました。
ko: Git이 브랜치 삭제를 거부했습니다.
zh_hans: Git 拒绝删除该分支。
zh_hant: Git 拒絕刪除該分支。

# deleteBranchLosesCommits
source: Commits held only by this branch: %@. Deleting it leaves them unreachable.
ja: このブランチだけが保持しているコミット: %@。削除すると到達できなくなります。
ko: 이 브랜치만 가지고 있는 커밋: %@개. 삭제하면 도달할 수 없게 됩니다.
zh_hans: 仅由该分支持有的提交：%@ 个。删除后它们将无法到达。
zh_hant: 僅由該分支持有的提交：%@ 個。刪除後它們將無法到達。

# deleteBranchKeepsEveryCommit
source: Every Commit on this branch is also held by another Ref, so deleting it loses none.
ja: このブランチのコミットはすべて他の参照も保持しているため、削除しても失われるコミットはありません。
ko: 이 브랜치의 모든 커밋은 다른 참조도 가지고 있으므로 삭제해도 잃는 커밋이 없습니다.
zh_hans: 该分支上的每个提交都还有其他引用持有，删除它不会丢失任何提交。
zh_hant: 該分支上的每個提交都還有其他參照持有，刪除它不會遺失任何提交。

# deleteBranchHelp
source: Delete this local branch. Its remote branch and Remote-tracking Branch are left untouched.
ja: このローカルブランチを削除します。リモートのブランチとリモート追跡ブランチはそのまま残ります。
ko: 이 로컬 브랜치를 삭제합니다. 원격 브랜치와 원격 추적 브랜치는 그대로 남습니다.
zh_hans: 删除该本地分支。其远程分支与远程跟踪分支保持不变。
zh_hant: 刪除該本機分支。其遠端分支與遠端追蹤分支保持不變。

# deleteBranchCheckFailedDescription
source: Colofa could not ask Git what removing this branch would cost, so nothing was deleted.
ja: このブランチを削除した場合の影響を Git に問い合わせられなかったため、何も削除していません。
ko: 이 브랜치를 삭제할 때의 대가를 Git에 물어보지 못해 아무것도 삭제하지 않았습니다.
zh_hans: Colofa 无法向 Git 询问删除该分支的代价，因此未删除任何内容。
zh_hant: Colofa 無法向 Git 詢問刪除該分支的代價，因此未刪除任何內容。

# deleteBranchCheckFailed
source: Could Not Read the Branch
ja: ブランチを読み取れませんでした
ko: 브랜치를 읽지 못했습니다
zh_hans: 无法读取该分支
zh_hant: 無法讀取該分支

# deleteBranchCancelledRefChangedTitle
source: Delete Branch Cancelled
ja: ブランチの削除を取り消しました
ko: 브랜치 삭제가 취소됨
zh_hans: 已取消删除分支
zh_hant: 已取消刪除分支

# deleteBranchCancelledRefChangedMessage
source: The branch changed after the confirmation opened, so nothing was deleted. Open Delete Branch again to see what it holds now.
ja: 確認ダイアログを開いた後にブランチが変化したため、何も削除していません。もう一度「ブランチを削除」を開いて現在の内容を確認してください。
ko: 확인 대화상자를 연 뒤 브랜치가 변경되어 아무것도 삭제하지 않았습니다. ‘브랜치 삭제’를 다시 열어 현재 상태를 확인하세요.
zh_hans: 确认对话框打开后该分支发生了变化，因此未删除任何内容。请重新打开“删除分支”查看它当前持有的内容。
zh_hant: 確認對話框開啟後該分支發生了變化，因此未刪除任何內容。請重新開啟「刪除分支」查看它目前持有的內容。

source: Delete Branch
ja: ブランチを削除
ko: 브랜치 삭제
zh_hans: 删除分支
zh_hant: 刪除分支

source: Discard Changes
ja: 変更を破棄
ko: 변경 사항 폐기
zh_hans: 放弃更改
zh_hant: 捨棄更動

# discardChangesConfirmTitle
source: Discard changes to “%@”?
ja: 「%@」の変更を破棄しますか？
ko: “%@”의 변경 사항을 폐기하시겠습니까?
zh_hans: 要放弃“%@”的更改吗？
zh_hant: 要捨棄「%@」的更動嗎？

# discardChangesConfirmMessage
source: Only unstaged changes are restored to the staged version. Staged Changes are kept. This cannot be undone.
ja: ステージされていない変更のみがステージ済みの内容に戻ります。ステージ済みの変更はそのまま残ります。この操作は取り消せません。
ko: 스테이지되지 않은 변경 사항만 스테이지된 내용으로 되돌립니다. 스테이지된 변경 사항은 그대로 유지됩니다. 이 작업은 취소할 수 없습니다.
zh_hans: 只有未暂存的更改会还原为已暂存的版本，已暂存的更改会保留。此操作无法撤销。
zh_hant: 只有未暫存的更動會還原為已暫存的版本，已暫存的更動會保留。此操作無法還原。

# discardChangesFailed
source: Changes Could Not Be Discarded
ja: 変更を破棄できませんでした
ko: 변경 사항을 폐기하지 못함
zh_hans: 无法放弃更改
zh_hant: 無法捨棄更動

source: Move to Trash
ja: ゴミ箱に入れる
ko: 휴지통으로 이동
zh_hans: 移到废纸篓
zh_hant: 移到垃圾桶

# moveToTrashConfirmTitle
source: Move “%@” to the Trash?
ja: 「%@」をゴミ箱に入れますか？
ko: “%@”을(를) 휴지통으로 이동하시겠습니까?
zh_hans: 要将“%@”移到废纸篓吗？
zh_hant: 要將「%@」移到垃圾桶嗎？

# moveToTrashConfirmMessage
source: This file is untracked, so Git has no copy to restore. Colofa moves it to the macOS Trash, where you can put it back.
ja: このファイルは追跡されていないため、Git には復元できるコピーがありません。Colofa は macOS のゴミ箱に移動するので、あとで戻せます。
ko: 이 파일은 추적되지 않으므로 Git에 복원할 사본이 없습니다. Colofa는 파일을 macOS 휴지통으로 옮기며, 나중에 되돌릴 수 있습니다.
zh_hans: 该文件未被跟踪，Git 没有可还原的副本。Colofa 会将它移到 macOS 废纸篓，你可以从那里放回。
zh_hant: 此檔案未被追蹤，Git 沒有可還原的副本。Colofa 會將它移到 macOS 垃圾桶，你可以從那裡放回。

# moveToTrashCancelledTitle
source: File Was Not Moved to the Trash
ja: ファイルはゴミ箱に入りませんでした
ko: 파일을 휴지통으로 옮기지 않음
zh_hans: 文件未移到废纸篓
zh_hant: 檔案未移到垃圾桶

# moveToTrashCancelledMessage
source: The operation was cancelled, so “%@” is still where it was.
ja: 操作がキャンセルされたため、「%@」は元の場所にあります。
ko: 작업이 취소되어 “%@”은(는) 원래 위치에 그대로 있습니다.
zh_hans: 操作已取消，“%@”仍在原处。
zh_hant: 操作已取消，「%@」仍在原處。

# moveToTrashFailedTitle
source: File Could Not Be Moved to the Trash
ja: ファイルをゴミ箱に入れられませんでした
ko: 파일을 휴지통으로 옮기지 못함
zh_hans: 无法将文件移到废纸篓
zh_hant: 無法將檔案移到垃圾桶

# moveToTrashFailedMessage
source: Colofa could not move “%1$@” to the Trash. %2$@
ja: Colofa は「%1$@」をゴミ箱に入れられませんでした。%2$@
ko: Colofa가 “%1$@”을(를) 휴지통으로 옮기지 못했습니다. %2$@
zh_hans: Colofa 无法将“%1$@”移到废纸篓。%2$@
zh_hant: Colofa 無法將「%1$@」移到垃圾桶。%2$@

source: Reveal in Finder
ja: Finder で表示
ko: Finder에서 보기
zh_hans: 在访达中显示
zh_hant: 在 Finder 中顯示

# revealInFinderFailedTitle
source: File Could Not Be Revealed
ja: ファイルを表示できませんでした
ko: 파일을 표시하지 못함
zh_hans: 无法显示文件
zh_hant: 無法顯示檔案

# revealInFinderFailedMessage
source: “%@” is no longer on disk. Colofa reloaded the Repository.
ja: 「%@」はディスク上に存在しません。Colofa はリポジトリを読み込み直しました。
ko: “%@”이(가) 디스크에 더 이상 없습니다. Colofa가 저장소를 다시 읽었습니다.
zh_hans: “%@”已不在磁盘上。Colofa 已重新读取仓库。
zh_hant: 「%@」已不在磁碟上。Colofa 已重新讀取儲存庫。

source: Copy Path
ja: パスをコピー
ko: 경로 복사
zh_hans: 拷贝路径
zh_hant: 拷貝路徑

source: File Actions
ja: ファイル操作
ko: 파일 동작
zh_hans: 文件操作
zh_hant: 檔案操作

source: Detached HEAD
ko: 분리된 HEAD
zh_hans: 分离的 HEAD
zh_hant: 分離的 HEAD

source: OK
ko: 확인
zh_hans: 好
zh_hant: 好
